src/features/tests/load/load-test-browse.yaml
config:
  target: "http://localhost:3000"
  processor: "./load.processor.js"
  phases:
    - duration: 20
      arrivalRate: 20
      name: warmup_20
    - duration: 70
      arrivalRate: 50
      rampTo: 150
      name: ramp_50_to_150
    - duration: 180
      arrivalRate: 150
      name: sustained_150_for_3m
    - duration: 30
      arrivalRate: 150
      name: spike_150
  defaults:
    headers:
      x-load-test-secret: "{{ $processEnvironment.LOAD_TEST_SECRET }}"
  http:
    timeout: 30
    pool: 1200

before:
  flow:
    - function: "bootstrapTournaments"

scenarios:
  - name: browse_platform_pages_only
    weight: 85
    flow:
      - function: "setupLoadTestAuth"
      - function: "browsePrep"
      - get:
          url: "/en"
          afterResponse: "capturePageMetrics"
      - think: "{{ thinkSec }}"
      - get:
          url: "/en/home"
          afterResponse: "capturePageMetrics"
      - think: "{{ thinkSec }}"
      - get:
          url: "/en/search"
          afterResponse: "capturePageMetrics"
      - think: "{{ thinkSec }}"
      - get:
          url: "/en/statistics"
          afterResponse: "capturePageMetrics"
      - think: "{{ thinkSec }}"
      - get:
          url: "/en/profile"
          afterResponse: "capturePageMetrics"
      - think: "{{ thinkSec }}"
      - get:
          url: "/en/myclub"
          afterResponse: "capturePageMetrics"
      - think: "{{ thinkSec }}"
      - get:
          url: "/en/tournaments/{{ tournamentCode }}"
          afterResponse: "capturePageMetrics"
      - think: "{{ thinkSec }}"
      - get:
          url: "/en/tournaments/{{ tournamentCode }}/live"
          afterResponse: "capturePageMetrics"
      - think: "{{ thinkSec }}"
      - get:
          url: "/en/board/{{ tournamentCode }}"
          afterResponse: "capturePageMetrics"

  - name: live_board_polling_only
    weight: 15
    flow:
      - function: "setupLoadTestAuth"
      - function: "pickTournamentContext"
      - get:
          url: "/en/board/{{ tournamentCode }}"
          afterResponse: "capturePageMetrics"
      - think: 2
      - get:
          url: "/en/tournaments/{{ tournamentCode }}/live"
          afterResponse: "capturePageMetrics"
      - think: 2
      - get:
          url: "/en/tournaments/{{ tournamentCode }}"
          afterResponse: "capturePageMetrics"
      - think: 2