src/features/tests/load/load-test-lifecycle.yaml
config:
  target: "http://localhost:3000"
  processor: "./load.processor.js"
  phases:
    - duration: 20
      arrivalRate: 20
      name: warmup_20
    - duration: 70
      arrivalRate: 50
      rampTo: 150
      name: ramp_50_to_150
    - duration: 180
      arrivalRate: 150
      name: sustained_150_for_3m
    - duration: 30
      arrivalRate: 150
      name: spike_150
  defaults:
    headers:
      x-load-test-secret: "{{ $processEnvironment.LOAD_TEST_SECRET }}"
  http:
    timeout: 30
    pool: 1200

before:
  flow:
    - function: "bootstrapTournaments"

scenarios:
  - name: tournament_lifecycle_parallel_only
    weight: 100
    flow:
      - function: "setupLoadTestAuth"
      - function: "pickTournamentContext"
      - function: "lifecycleStep"
      - think: 1