src/features/tests/load/load-test.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 90
      arrivalRate: 50
      rampTo: 500
      name: ramp_up_50_to_500
    - duration: 180
      arrivalRate: 500
      name: sustained_500
    - duration: 60
      arrivalRate: 1000
      name: spike_1000
  processor: "./load.processor.js"
  http:
    timeout: 30
    pool: 1000
  ensure:
    thresholds:
      - "http.response_time.p95": 300
      - "errors.rate": 0.01
      - "vusers.failed": 5%

scenarios:
  - name: createTournament_to_addPlayer_to_updateBoard
    weight: 7
    flow:
      - function: "prepareAuthAndPayloads"
      - think: "{{ thinkSec }}"
      - get:
          url: "/en/clubs/DEMO"
          headers:
            authorization: "{{ authHeader }}"
            cookie: "{{ authCookie }}"
      - think: "{{ thinkSec }}"
      - get:
          url: "/en/tournaments/DEMO"
          headers:
            authorization: "{{ authHeader }}"
            cookie: "{{ authCookie }}"
      - think: "{{ thinkSec }}"
      - get:
          url: "/en/board/DEMO"
          headers:
            authorization: "{{ authHeader }}"
            cookie: "{{ authCookie }}"

  - name: checkFeatureFlagAction
    weight: 3
    flow:
      - function: "prepareAuthAndPayloads"
      - think: "{{ thinkSec }}"
      - get:
          url: "/en/tournaments/DEMO/live"
          headers:
            authorization: "{{ authHeader }}"
            cookie: "{{ authCookie }}"

  - name: updateBoardStatusAction
    weight: 2
    flow:
      - function: "prepareAuthAndPayloads"
      - think: "{{ thinkSec }}"
      - get:
          url: "/en/board/DEMO"
          headers:
            authorization: "{{ authHeader }}"
            cookie: "{{ authCookie }}"

  - name: sse_updates_stream
    weight: 1
    flow:
      - function: "prepareAuthAndPayloads"
      - think: "{{ thinkSec }}"
      - function: "sseUpdatesProbe"